[
    {
        "id": "1",
        "categoryLogo": "https://www.channelpronetwork.com/sites/default/files/company/logos/originalimagesgooglelogo.jpg",
        "jobTitle": "Software Engineer",
        "companyName": "Google.",
        "remoteOrOnsite": "Remote",
        "location": "Any Location",
        "fullTimeOrPartTime": "Full-time",
        "salary": 80000,
        "jobDescription": "SoftWire Inc. is seeking an experienced Software Engineer to join our dynamic team. The ideal candidate will have strong programming skills and expertise in Java and Python.",
        "jobResponsibility": "Responsibilities will include designing, coding, testing, debugging, and documenting software applications, collaborating with cross-functional teams, troubleshooting and resolving software defects, and contributing to software development best practices.",
        "EducationRequirements": "Bachelor's degree in Computer Science or related field",
        "Experiences": "Minimum 3 years of professional software development experience",
        "phone": "+1 123-456-7890",  
        "email": "careers@softwire.com"
    },
    {
        "id": "2",
        "categoryLogo": "https://news-cdn.softpedia.com/images/news2/Microsoft-Redesigns-Its-Logo-for-the-First-Time-in-25-Years-Here-It-Is-3.png",
        "jobTitle": "Frontend Developer",
        "companyName": "Microsoft SoftWire Inc.",
        "remoteOrOnsite": "Remote",
        "location": "San Francisco, CA",
        "fullTimeOrPartTime": "Full-time",
        "salary": 90000,
        "jobDescription": "SoftWire Inc. is seeking a talented Frontend Developer to create innovative user interfaces for our web applications. The ideal candidate will have strong skills in HTML, CSS, and JavaScript.",
        "jobResponsibility": "Responsibilities will include designing and implementing responsive user interfaces, collaborating with UX/UI designers, optimizing web performance, troubleshooting and fixing frontend defects, and contributing to frontend development best practices.",
        "EducationRequirements": "Bachelor's degree in Computer Science or related field",
        "Experiences": "Minimum 2 years of professional frontend development experience",
        "phone": "+1 123-456-7890",
        "email": "careers@softwire.com"
    },
    {
        "id": "3",
        "categoryLogo": "https://1000logos.net/wp-content/uploads/2018/02/Color-Tesla-logo.jpg",
        "jobTitle": "Quality Assurance Analyst",
        "companyName": "Tesla Inc.",
        "remoteOrOnsite": "Remote",
        "location": "New York, NY",
        "fullTimeOrPartTime": "Full-time",
        "salary": 75000,
        "jobDescription": "SoftWire Inc. is seeking a detail-oriented Quality Assurance Analyst to ensure the quality and reliability of our software products. The ideal candidate will have strong skills in manual and automated testing.",
        "jobResponsibility": "Responsibilities will include creating and executing test plans, identifying and documenting defects, working closely with development and product teams, providing feedback on usability and functionality, and contributing to continuous improvement of the QA process.",
        "EducationRequirements": "Bachelor's degree in Computer Science or related field",
        "Experiences": "Minimum 3 years of professional QA testing experience",
        "phone": "+1 123-456-7890",
        "email": "careers@softwire.com"
    },
    {
        "id": "4",
        "categoryLogo": "https://d24v5oonnj2ncn.cloudfront.net/wp-content/uploads/2018/10/16030301/Amazon-Logo-Black.jpg",
        "jobTitle": "Product Manager",
        "companyName": "Amazon.",
        "remoteOrOnsite": "Remote",
        "location": "Seattle, WA",
        "fullTimeOrPartTime": "Full-time",
        "salary": 100000,
        "jobDescription": "SoftWire Inc. is looking for a talented Product Manager to drive the vision, strategy, and execution of our software products. The ideal candidate will have a strong understanding of customer needs, market trends, and product development processes.",
        "jobResponsibility": "Responsibilities will include defining product roadmap, conducting market research, gathering and prioritizing product requirements, working with cross-functional teams to develop and launch products, analyzing product performance data, and driving product adoption and customer satisfaction.",
        "EducationRequirements": "Bachelor's degree in Business, Computer Science, or related field",
        "Experiences": "Minimum 5 years of experience in product management, preferably in software or technology industry",
        "phone": "+1 123-456-7890",
        "email": "careers@softwire.com"
    },
    {
        "id": "5",
        "categoryLogo": "https://logos.flamingtext.com/Word-Logos/being-design-china-name.png",
        "jobTitle": "QA Engineer",
        "companyName": "Being SoftWire Inc.",
        "remoteOrOnsite": "Remote",
        "location": "Austin, TX",
        "fullTimeOrPartTime": "Full-time",
        "salary": 75000,
        "jobDescription": "SoftWire Inc. is seeking a detail-oriented and experienced QA Engineer to ensure the quality of our software products. The ideal candidate will have expertise in manual and automated testing, test planning, and defect tracking.",
        "jobResponsibility": "Responsibilities will include designing and executing test plans, identifying and documenting defects, collaborating with development team to resolve issues, conducting regression testing, maintaining test documentation, and providing feedback on product quality.",
        "EducationRequirements": "Bachelor's degree in Computer Science, Software Engineering, or related field",
        "Experiences": "Minimum 3 years of professional QA/testing experience",
        "phone": "+1 123-456-7890",
        "email": "careers@softwire.com"
    },
        {
            "id": "6",
            "categoryLogo": "https://mma.prnewswire.com/media/927546/Toptal_Logo.jpg?p=facebook",
            "jobTitle": "Software Developer",
            "companyName": "Toptal SoftWire Inc.",
            "remoteOrOnsite": "Remote",
            "location": "Any Location",
            "fullTimeOrPartTime": "Full-time",
            "salary": 90000,
            "jobDescription": "SoftWire Inc. is looking for a skilled Software Developer to join our talented team. The ideal candidate will have a strong background in software development, with expertise in Java, C++, or Python.",
            "jobResponsibility": "Responsibilities will include developing high-quality software solutions, collaborating with cross-functional teams to design and implement software applications, debugging and resolving software defects, and providing technical support to customers.",
            "EducationRequirements": "Bachelor's degree in Computer Science, Software Engineering, or related field",
            "Experiences": "Minimum 3 years of professional software development experience",
            "phone": "+1 123-456-7890",
            "email": "careers@softwire.com"
        }
        
    ]
    
